#hw day 02 
# 2)
#რა არის Debugging
# Debugging არის რაიმეს გამართვა კონკრეტული დეფექტების აღმოჩენა და შესწორება (მექანიზმებში, ხელსაწყოებში, კომპიუტერულ პროგრამებში)

#print(my_name) my_name = "Your name ამ კონკრეტულ error ში ჩვენ გვაკლია ე.წ (ბრჭყალები) და ასევე ჩარჩოები ()
# ასევე თავდაპირველად ვწერთ my_name = ("piercemyheart") print(my_name) აშემდეგ კი სწორი ჩანაწერი კი იქნება ესე 

my_name = ("piercemyheart")
print(my_name)


# 3)
# შექმენით ორი ცვლადი პირველში შეინახეთ ერთი მთელი რიცხვი 
# მეორეში კი ათწილადი თქვენი დავალებაა რომ მოცემული ცვლადების მნიშვნელობები ერთმანეთთან დააჯამოთ და გამოიტანოთ ეკრანზე

# ცვლადის ათწილადიდან რიცხვიდან მთელ რიცხვად შეცვლა
height = 1.75 #float 
height = 1  #float 

# ცვლადის მთელი რიცხვიდან ათწილადად შეცვლა
height = 1      #float
height = 1.75    #float

# 4)  შექმენით ორი ცვლადი მათში შეინახეთ რაიმე რიცხვები თქვენი დავალებაა რომ ამ ორ რიცხვზე მოახდინოთ მათემატიკური ოპერაციები როგორიცაა +-*/
 
print (10 + 10)
print (22-11)
print (4*9)

#5) გაასწორეთ შეცდომები
#age = "25"
#print(age + 5)
age = 25
print (age + 5)

#6) შექმნით რაიმოდენიმე ცვლადი მაგალითად თქვენი სახელის გვარის ასაკის სიმაღლის ქალაქის სადაც ცხოვრობთ და ასე შემდეგ 
# ამ ცვლადების გამოყენებით დაბეჭდეთ ერთი მთლიანი წინადადება

my_name = "Datuna"
print(my_name)
my_last_name = "korkelia"
print(my_last_name)
city = "Tbilisi"
print(city)
age = 16
print(age)

#7) რას გამოიტანს ქვემოთ მოცემული კოდი და რატომ

#total = 100
#print(totl)
#totl-ის დაწერით გამოიტანს ე.წ error რადგან მაღლა გვიწერია "total"  მაგრამ თუ დავწერთ Print (total) იქნება აფსოლუტურად სწორი! 
#მაგ:
total = 100
print (total) 

#8) შექმენით ერთი ცვლადი სახელად total მასში შეინახეთ 120, 
# შექმენით მეორე ცვლადი სახელად people რომელშიც ინახავთ მნიშვნელობას 4 თქვენი დავალებაა რომ გამოითვალოთ თუ რამდენს იხდის ერთი ადამიანი

total = 120
print (total)

people = 4
print (total / 4)

#9)შექმენით ერთი ცვლადი სახელად price შეინახეთ მასში ნებიმიერი რიცხვი მაგალითად 80 შექმენით 
# მეორე ცვლადი სახელად discount - შეინახეთ მასში ათწილადი მნიშვნელობა 0.5 თქვენი დავალებაა რომ გამოიტანოთ საბოლოო ფასი discount - ის შემდეგ

price = 80.0
print (price)

discount = 0.5
print (price * 0.5)

#10) მოიძიეთ ინფორმაცია if else statement - ების შესახებ პითონში, შექმენით ერთი ცვლადი მასში შეინახეთ რაიმე რიცხვი
#თქვენი დავალებაა რომ შეამოწმოთ იმ შემთხვევაში თუ რიცხვი უნაშთოდ იყოფა 2 - ზე გამოიტანეთ რომ The number is even სხვა შემთხვევაში კი The number is odd 
#იმისათვის რომ შეამოწმოთ იყოფა თუ არა რიცხვი უნაშთოდ ორზე გამოიყენეთ % პროცენტული გაყოფა

# შევქმნათ ცვლადი და შევინახოთ მასში რაიმე რიცხვი
number = 7 

# % ნიშნავს "უნაშთო გაყოფის ნაშთის პოვნას"
# თუ ნაშთი 0-ია — რიცხვი უნაშთოდ იყოფა 2-ზე (ანუ ლუწია)

number = 10

if number % 2 == 0:
    print ("the number is even")
else:
    print ("the number is odd")
