print("datuna korkelia")
print("day 1 homework")

#print ბრძანებით შეგვიძლია ჩვენ გამოვიტანოთ ბრძანება ეკრანზე (ან კონსოლში) 

# ცვლადების შექმნა
saxeli = "Datuna"
gvari = "Korkelia"
asaki = 16
simagle = 1.76

# ცვლადების დაბეჭდვა
print("saxeli", saxeli)
print("gvari", gvari)
print("asaki", asaki)
print("simagle", simagle)

#ნებისმიერი რიცხვი და გარდაქმენით ის ორობით სისტემაში

# 96
#96÷2 = 48 	ნაშთი 0
#48÷2 = 24 	ნაშთი 0
#24÷2 = 12 	ნაშთი 0
#12÷ 2 = 6 	ნაშთი 0
#6 ÷ 2 = 3 	ნაშთი 0
#3 ÷ 2 = 1 	ნაშთი 1
#1 ÷ 2 = 0 	ნაშთი 1



# 59
# 59 ÷ 2 = 29 ნაშთი 1
# 29 ÷ 2 = 14 ნაშთი 1
# 14 ÷ 2 = 7 ნაშთი 0
# 7 ÷ 2 = 3 ნაშთი 1
# 3 ÷ 2 = 1 ნაშთი 1
# 1 ÷ 2 = 0 ნაშთი 1


# 26
# 26/2 ÷ 13ნაშთი 0
# 13/2 ÷ 6 ნაშთი 1
# 6/2 ÷  3 ნაშთი 0
# 3/2 ÷  1 ნაშთი 1
# 1/2 ÷  0 ნაშთი 1


# 76
#76/2 ÷ 38 ნაშთი	0
#38/2 ÷ 19 ნაშთი	0
#19/2 ÷ 9  ნაშთი	1
#9/2 ÷ 4   ნაშთი	1
#4/2 ÷ 2   ნაშთი	0
#2/2 ÷ 1   ნაშთი	0
#1/2 ÷ 0   ნაშთი    1




#ცვლადის დეკლარაცია არის პროცესი. როდესაც  ვამბობთ ეს არის ცვლადი და მას ერქმევა კონკრეტული რაიმე სახელი

#მაგალითად: 
# name = "Datuna" ინახავს ტექსტს (სახელს-მეტსახელს)
# age = "16" ინახავს რიცხვს (ასაკს-რაიმე რიცხვს)
# height = 1.75 ინახავს ათწილად რიცხვს

#შეჯამება 
#ცვლადის დეკლარაცია არის კონკრეტული ცვლადის შექმნა და სახელის ან მეტსახელის მინიჭება,
#რათა მასში მონაცემი შევინახოთ და შემდეგ გამოვიყენოთ.





